function OurTeam() {
	const reviews = [
		
		{
			name: 'Поліна',
			position: 'PR-директорка',
			text: 'Дипломована журналістка та майстер зі зв’язків із громадськістю, з багаторічним досвідом роботи в маркетингу, рекламі та PR. Поліна вважає, що реклама – це рушій прогресу.',
			quote: '«Реклама – це мистецтво переконання»',
			photo: 'photo1.png',
			alt: 'Телеграм бот відгук'
		},
		{
			name: 'Кирил',
			position: 'Старший менеджер',
			text: 'Чотири роки досвіду в автомобільній сфері. Експерт із пошуку вигідних пропозицій. Завдяки його допомозі клієнти економлять час і гроші.',
			quote: '«Автомобілі можуть бути будь-якими, тільки не російськими»',
			photo: 'photo3.png',
			alt: 'Чат-бот відгук'
		},
		{
			name: 'Андрій',
			position: 'Менеджер із продажу авто',
			text: 'Спеціалізується на автомобілях японського ринку. Знає всі тонкощі брендів Honda, Toyota, Nissan. Допоможе обрати авто, яке служитиме роками.',
			quote: '«Краще автомобіля може бути лише два автомобілі»',
			photo: 'photo4.png',
			alt: 'Чат-бот відгук'
		},
		{
			name: 'Артем',
			position: 'Менеджер із продажу авто',
			text: 'Фахівець із авто преміум-класу. Знає все про технічні характеристики і завжди знаходить ідеальний варіант для клієнта.',
			quote: '«Кінські сили продають авто, а крутний момент – виграє гонку»',
			photo: 'photo6.png',
			alt: 'Чат-бот відгук'
		},
		{
			name: 'Максим',
			position: 'Менеджер із продажу авто',
			text: 'Експерт із авто преміум-класу. Його мета – забезпечити клієнта комфортом і стилем на дорозі.',
			quote: '«Преміальний автомобіль – це вибір тих, хто цінує комфорт і стиль»',
			photo: 'photo8.png',
			alt: 'Чат-бот відгук'
		},
		{
			name: 'Вікторія Анатоліївна',
			position: 'Бухгалтер',
			text: 'Відповідальна за фінансову стабільність компанії. Вміє знайти баланс між прибутком та якістю послуг.',
			quote: '«Фінансова стабільність – це основа будь-якого бізнесу»',
			photo: 'photo12.png',
			alt: 'Телеграм-бот відгук'
		},
		{
			name: 'Дмитро',
			position: 'Менеджер із підбору авто',
			text: 'Експерт із підбору авто з ринку США. Знає всі тонкощі аукціонів Copart та IAAI і допомагає знайти авто мрії.',
			quote: '«Американські авто – це більше, ніж просто транспорт»',
			photo: 'photo9.png',
			alt: 'Телеграм-бот відгук'
		},
		{
			name: 'Олександр',
			position: 'Менеджер із підбору запчастин',
			text: 'Фахівець із пошуку оригінальних запчастин для будь-якого авто. Знаходить навіть найрідкісніші деталі.',
			quote: '«Ідеальна запчастина – це та, яку не помічаєш»',
			photo: 'photo10.png',
			alt: 'Телеграм-бот відгук'
		},
		{
			name: 'Федір',
			position: 'Менеджер із підбору запчастин',
			text: 'Експерт із швидкого пошуку нових і вживаних деталей. Завжди дбає про якість та відповідність до стандартів.',
			quote: '«Автомобіль без потрібних деталей – це лише набір металу»',
			photo: 'photo11.png',
			alt: 'Чат-бот відгук'
		},
		{
			name: 'Владислав',
			position: 'Керівник відділу продажів',
			text: 'Експерт із підбору авто на аукціонах з понад семирічним досвідом в автоіндустрії. Уважно перевіряє кожну деталь, щоб знайти ідеальний автомобіль для клієнта.',
			quote: '«Автомобіль – це найкраща іграшка для дорослих»',
			photo: 'photo2.png',
			alt: 'Телеграм бот відгук'
		},
		{
			name: 'Микола Олександрович',
			position: 'Власник компанії',
			text: 'Візіонер і лідер, який створив цей бізнес. Його місія – підвищити якість обслуговування клієнтів та розвивати автомобільну культуру.',
			quote: '«Успішний бізнес – це довіра клієнтів і команда професіоналів»',
			photo: 'photo7.png',
			alt: 'Телеграм-бот відгук'
		},
		{
			name: 'Антип',
			position: 'Логіст',
			text: 'Експерт із міжнародної логістики та оформлення документів. Гарантує безпроблемне транспортування автомобілів з-за кордону.',
			quote: '«Українські автомобілі надійніші за українських політиків»',
			photo: 'photo5.png',
			alt: 'Чат-бот відгук'
		},

	];

	return (
		<section 
			id="reviews" 
			className="py-10 bg-cover bg-center text-white"
			style={{ backgroundImage: 'url(/public/socials.png)' }}
		>
			<div className="container">
				<div className="w-full text-center mb-10">
					<h2 className="text-5xl font-bold mb-5">Наша команда</h2>
					<hr className="border-t-2 border-red-300 mx-auto w-1/4 mb-5" />
				</div>
				<div className="grid grid-cols-2 sm:grid-cols-2 lg:grid-cols-3 gap-4">
					{reviews.map((review, index) => (
						<div 
							key={index} 
							className="flex flex-col lg:flex-row items-center text-center lg:text-left p-4 rounded-lg"
							style={{
								backgroundColor: 'rgba(0, 0, 0, 0.3)',
								backdropFilter: 'blur(2px)',
							}}
						>
							<img 
								src={review.photo} 
								alt={review.alt} 
								className="w-16 h-16 sm:w-24 sm:h-24 rounded-full mb-3 lg:mb-0 lg:mr-4" 
							/>
							<div>
								<p className="text-sm sm:text-base font-extrabold uppercase">{review.name}</p>
								<p className="text-xs sm:text-sm font-bold">{review.position}</p>
								<p className="text-xs sm:text-sm mt-2">{review.text}</p>
								<p className="text-xs sm:text-sm mt-2 italic text-gray-300">{review.quote}</p>
							</div>
						</div>
					))}
				</div>
			</div>
		</section>
	);
}

export default OurTeam;